Repository: quarkusio/ja.quarkus.io
Catalog: l10n/tmx/quarkus.tmx
Source language: en_us
Languages: ja_jp

source: Split the custom cookie value into two parts: the first part is the encrypted token, and the last part is the tenant ID.
ja_jp: カスタム Cookie 値を 2 つの部分に分割します。最初の部分は暗号化されたトークン、最後の部分はテナント ID です。

source: Spring Boot `@ConfigurationProperties` has a few limitations. For instance, `Map` injection is not supported. Consider using xref:config-mappings.adoc[Mapping configuration to objects].
ja_jp: Spring Boot `@ConfigurationProperties` にはいくつかの制限があります。例えば、 `Map` インジェクションはサポートされていません。 link:config-mappings.html[オブジェクトへのマッピング設定] の使用を検討してください。

source: Spring DI Configuration Reference
ja_jp: Spring DI 設定リファレンス

source: Spring Data REST simplifies the creation of CRUD applications based on our Spring Data compatibility layer.
ja_jp: Spring Data RESTは、当社のSpring Data互換性レイヤをベースにCRUDアプリケーションの作成を簡素化します。

source: Spring documentation
ja_jp: Springのドキュメント

source: Stable Innovation:
ja_jp: 安定したイノベーション:

source: Stacks produced by `stackcount` need to be collapsed before they can be transformed into flamegraphs. For example:
ja_jp: `stackcount` で生成されたスタックは、flamegraph に変換する前に折りたたむ必要があります。例えば、以下のような感じです:

source: Stage
ja_jp: ステージ

source: Stand up a Config Server
ja_jp: Config Serverの起動

source: Standard ID Handlers: Fixed Format
ja_jp: 標準 ID ハンドラー: 固定形式

source: Standard Java command line option that should be added to command line launching an application in dev mode
ja_jp: 開発モードでアプリケーションを起動するコマンドラインに追加する必要がある標準の Java コマンドラインオプション

source: Standard level name
ja_jp: 標準レベル名

source: Standards
ja_jp: 標準仕様

source: Standards based
ja_jp: 標準ベース

source: Standards based Quarkus brings all the standards and frameworks you love and use: RESTEasy, Hibernate, Netty, vert.x, Camel...)
ja_jp: 標準ベースの Quarkus は、お好みで使用されているすべての標準やフレームワークを提供します (RESTEasy、Hibernate、Netty、vert.x、Camelなど)

source: Standards-based
ja_jp: 標準ベース

source: Start AMQP automatically in dev and test modes.
ja_jp: 開発モードやテストモードでAMQPを自動的に起動します。

source: Start Apache Kafka automatically in dev and test modes.
ja_jp: 開発モードやテストモードでApache Kafkaを自動的に起動します。

source: Start Apicurio Registry automatically in dev and test modes.
ja_jp: 開発モードやテストモードでApicurio Registryを自動的に起動します。

source: Start Elasticsearch automatically in dev and test modes
ja_jp: 開発モードとテストモードでElasticsearchを自動的に起動します。

source: Start Elasticsearch automatically in dev and test modes.
ja_jp: 開発モードとテストモードで自動的にElasticsearchを起動。

source: Start Infinispan automatically in dev and test modes.
ja_jp: 開発モードやテストモードで自動的にInfinispanを起動します。

source: Start Keycloak or other providers automatically in dev and test modes.
ja_jp: Keycloakや他のプロバイダーを開発モードやテストモードで自動的に起動します。

source: Start Kogito automatically in dev and test modes.
ja_jp: 開発モードとテストモードで自動的にKogitoを起動します。

source: Start Quarkus
ja_jp: Quarkusの起動

source: Start Quarkus in dev mode:
ja_jp: Quarkus を開発モードで起動します。

source: Start RabbitMQ automatically in dev and test modes.
ja_jp: 開発モードとテストモードで自動的にRabbitMQを起動します。

source: Start Redis automatically in dev and test modes.
ja_jp: 開発モードとテストモードで自動的にRedisを起動します。

source: Start a Hibernate ORM transaction. The transaction is committed when the method returns.
ja_jp: Hibernate ORM トランザクションを開始します。トランザクションは、メソッドが返されたときにコミットされます。

source: Start a Hibernate Reactive transaction and commit it when the method returns.
ja_jp: Hibernate Reactive トランザクションを開始し、メソッドが返ったらコミットします。

source: Start a Kafka transaction and send the payload to Kafka record,
ja_jp: Kafka トランザクションを開始し、ペイロードを Kafka レコードに送信します。

source: Start a Kubernetes API server automatically in dev and test modes.
ja_jp: 開発モードやテストモードでKubernetes API サーバーを自動的に起動します。

source: Start a new LRA:
ja_jp: 新しいLRAを開始します。

source: Start an LRA at the first service:
ja_jp: 最初のサービスでLRAを開始します。

source: Start an LRA using `curl` to send a request the new method we have just added:
ja_jp: `curl` を使ってLRAを開始し、今回追加した新しいメソッドにリクエストを送信します。

source: Start an all-in-one Grafana OTel LGTM system for traces and metrics.
ja_jp: トレースとメトリクス用のオールインワン Grafana OTel LGTM システムの開始。

source: Start an all-in-one Grafana OTel LGTM system for traces, metrics and logs.
ja_jp: トレース、メトリクス、ログのためのオールインワンのGrafana OTel LGTMシステムを開始します。

source: Start an instance of the native service:
ja_jp: ネイティブサービスのインスタンスを起動します。

source: Start and configure the Keycloak server
ja_jp: Keycloakサーバーの起動と設定

source: Start authenticating an opening WebSocket handshake request only when the `io.quarkus.oidc.BearerTokenAuthentication` annotation is detected.
ja_jp: `io.quarkus.oidc.BearerTokenAuthentication` アノテーションが検出された場合にのみ、WebSocket ハンドシェイク リクエストの認証を開始します。

source: Start by adding the following dependencies to your test project:
ja_jp: テストプロジェクトに以下の依存関係を追加することから始めます。

source: Start by creating a new Quarkus project. Open a terminal and run the following command:
ja_jp: 新しい Quarkus プロジェクトを作成することから始めます。ターミナルを開き、以下のコマンドを実行します。

source: Start by defining an _empty_ ConfigMap, which will be populated with the CA certificate:
ja_jp: まず、CA 証明書を入力する _空_ の ConfigMap を定義します。

source: Start by implementing `ProtectedResource`:
ja_jp: まず、 `ProtectedResource` を実装します。

source: Start by implementing the `/api/users/me` endpoint. The following code defines a Jakarta REST resource that provides user details:
ja_jp: `/api/users/me` エンドポイントの実装から開始します。 次のコードは、ユーザーの詳細を提供する Jakarta REST リソースを定義します。

source: Start by implementing the `/{tenant}` endpoint. As you can see from the source code below, it is just a regular Jakarta REST resource:
ja_jp: まず、`/{tenant}` エンドポイントを実装することから始めます。 以下のソースコードからわかるように、これは単なる通常の Jakarta REST リソースです。

source: Start by registering your WebAuthn credentials by entering a username, first and last names on the `Register` form on the right, then pressing the `Register` button:
ja_jp: まず、右側の `Register` フォームにユーザー名、氏名を入力し、 `Register` ボタンを押して、WebAuthn の認証情報を登録します。

source: Start from configuring one or more OIDC client registrations:
ja_jp: まず、1 つ以上の OIDC クライアント登録を設定します。

source: Start testing by reserving a domain in ngrok:
ja_jp: ngrok でドメインを予約してテストを開始します。

source: Start the Kafka broker and the schema registry using:
ja_jp: Kafka ブローカーとスキーマレジストリーを次のように起動します:

source: Start the Narayana LRA coordinator automatically in dev and test modes.
ja_jp: 開発モードおよびテストモードで Narayana LRA コーディネーターを自動的に起動します。

source: Start the OpenTelemetry Collector and Jaeger system via the following `docker-compose.yml` file that you can launch via `docker-compose up -d`:
ja_jp: `docker-compose up -d` OpenTelemetry CollectorとJaegerシステムを、以下の `docker-compose.yml` ファイルを介して起動します。

source: Start the PostgreSQL server
ja_jp: PostgreSQL サーバーの起動

source: Start the application
ja_jp: アプリケーションを起動します。

source: Start the application in dev mode:
ja_jp: アプリケーションを開発モードで実行します。

source: Start the database instance using the configuration options supplied in the `docker-compose.yml` file
ja_jp: `docker-compose.yml` ファイルで提供されている設定オプションを使用してデータベースインスタンスを起動します

source: Start the mass indexer and wait for it to finish.
ja_jp: 大量インデクサーを起動し、完了するまで待ちます。

source: Start the xref:getting-started.adoc[Getting Started] application (or any other application) using:
ja_jp: link:getting-started.html[入門ガイド] アプリケーション（またはその他のアプリケーション）を起動します。

source: Start two instances of the application and a load balancer
ja_jp: アプリケーションとロードバランサーの2つのインスタンスを起動

source: Start with Serverless
ja_jp: サーバーレスで始める

source: Start with adding the `smallrye-jwt` dependency:
ja_jp: まず、 `smallrye-jwt` の依存関係を追加することから始めます:

source: Start with adding the following dependency:
ja_jp: 以下の依存関係を追加することから始めます。

source: Start with the following test code :
ja_jp: 次のテストコードから始めます。

source: Start your application in dev mode:
ja_jp: アプリケーションを開発モードで起動します。

source: Start your application without configuring `quarkus.oidc` properties in `application.properties` with:
ja_jp: 次のコマンドを使用して、 `application.properties` の `quarkus.oidc` プロパティーを設定せずにアプリケーションを起動します。

source: Start your application without configuring `quarkus.oidc` properties in the `application.properties` file:
ja_jp: `application.properties` ファイルで `quarkus.oidc` プロパティーを設定せずにアプリケーションを起動します。

source: Start your application:
ja_jp: アプリケーションを起動します。

source: Start your document with a title, which in AsciiDoc is defined as a `= Level 0` heading. Where appropriate, divide your content into subsections, which in AsciiDoc are defined as `== Level 1` to `====== Level 5`. Do not skip any levels.
ja_jp: ドキュメントはタイトルから始めます。AsciiDoc では、タイトルは `= Level 0` 見出しとして定義されています。 必要に応じて、コンテンツをサブセクションに分割します。AsciiDoc では、サブセクションは `== Level 1` から `====== Level 5` として定義されています。 どのレベルもスキップしないでください。

source: StartTLS: The client connects to the server using a plain connection and then upgrades to a secure connection.
ja_jp: StartTLS: クライアントは、まずプレーン接続を使用してサーバーに接続し、その後セキュアな接続にアップグレードします。

source: Starting Kafka in a test resource
ja_jp: テストリソースでの Kafka の起動

source: Starting a Service
ja_jp: サービスの開始

source: Starting and Configuring the Keycloak Server
ja_jp: Keycloak サーバーの起動と設定

source: Starting and configuring the Keycloak server
ja_jp: Keycloak サーバーの起動と設定

source: Starting and stopping transactions: defining your boundaries
ja_jp: トランザクションの開始と停止:境界線の定義

source: Starting fast by doing less: the build-time principle
ja_jp: 最小限の作業で高速起動: ビルド時原則

source: Starting from Quarkus 3.19, the _builder_ image is based on UBI 9, and thus requires an UBI 9 base image if you want to run the native executable in a container. You can switch back to UBI 8, by setting the `quarkus.native.builder-image` property to one of the available image from the https://quay.io/repository/quarkus/ubi-quarkus-mandrel-builder-image?tab=tags[quay.io repository]. For example ``quay.io/quarkus/ubi-quarkus-mandrel-builder-image:{mandrel-flavor}` is using UBI 8, and so the resulting native executable will be compatible with UBI 8 base images.
ja_jp: Quarkus 3.19 以降、 _ビルダー_ イメージはUBI 9 をベースにしているため、ネイティブ実行可能ファイルをコンテナで実行する場合は UBI 9 のベースイメージが必要です。 UBI8に戻すには、 `quarkus.native.builder-image` プロパティを link:https://quay.io/repository/quarkus/ubi-quarkus-mandrel-builder-image?tab=tags[quay.ioリポジトリ] から利用可能なイメージの1つに設定します。 例えば、 ``quay.io/quarkus/ubi-quarkus-mandrel-builder-image:{mandrel-flavor}` は UBI 8 を使用しているので、生成されるネイティブ実行可能ファイルは UBI 8 のベースイメージと互換性があります。

source: Starting from a simple project and two tests
ja_jp: 簡単なプロジェクトと2つのテストから始める

source: Starting now, when you wish to try some new extensions, you directly have the code showing you their true power, ready to run in your favorite IDE in a matter of seconds!
ja_jp: 今から、いくつかの新しいエクステンションを試してみたいときには、その真の力を示すコードが直接表示され、お気に入りのIDEであっという間に実行できるようになります!

source: Starting point
ja_jp: 開始点

source: Starting services before the Quarkus application starts
ja_jp: Quarkus アプリケーションの開始前にサービスを開始する

source: Starting the Redis server
ja_jp: Redisサーバーの起動

source: Starting the application displays a screen similar to this one:
ja_jp: アプリケーションを起動すると、このような画面が表示されます：

source: Starting the broker
ja_jp: ブローカーの開始

source: Starting with 1.8, you can use CDI injection in Quartz jobs.
ja_jp: 1.8からは、QuartzジョブでCDIインジェクションを使用できるようになりました。

source: Starting with 1.9, you can connect to multiple instances. Also Sentinel is now supported.
ja_jp: 1.9 からは、複数のインスタンスに接続できるようになりました。また、Sentinel にも対応しました。

source: Starting with 2.9, you can use the new `quarkus.http.filter` configuration properties to do so as documented in the link:/guides/http-reference#additional-http-headers-per-path[HTTP Reference guide].
ja_jp: 2.9 からは、 link:/guides/http-reference#additional-http-headers-per-path[HTTP Reference ガイド] に記載されているように、新しい `quarkus.http.filter` 設定プロパティを使用して、これを行うことができます。

source: Starting with 22.3, Mandrel does not provide a `-java11` variant anymore. Use the `-java17` image instead.
ja_jp: 22.3 以降、Mandrel は `-java11` を提供しなくなりました。代わりに `-java17` イメージを使用してください。

source: Starting with 22.3, Mandrel does not provide a `-java11` version anymore. Note, however, that this doesn't mean that you may no longer produce native executables with Mandrel for Java 11 projects. You can still compile your Java 11 projects using OpenJDK 11 and produce native executables from the resulting Java 11 bytecode using the `-java17` Mandrel builder images.
ja_jp: 22.3 以降、Mandrel は `-java11` バージョンを提供しなくなりました。しかし、これは Java 11 プロジェクトで Mandrel を使用してネイティブ実行可能ファイルを作成することができなくなったことを意味するものではありません。OpenJDK 11 を使用して Java 11 プロジェクトをコンパイルし、 `-java17` Mandrel ビルダーイメージを使用して、結果の Java 11 バイトコードからネイティブ実行可能ファイルを生成することは可能です。

source: Starting with GraalVM 22.2.0 it is possible to create heap dumps upon request, e.g. `kill -SIGUSR1 <pid>`. Support for dumping the heap dump upon an out of memory error will follow up.
ja_jp: GraalVM 22.2.0 からは、要求に応じてダンプをヒープすることが可能になります (例: `kill -SIGUSR1 <pid>`)。メモリー不足エラーの際のヒープダンプのダンプのサポートは、今後追加される予定です。

source: Starting with GraalVM 22.2.0 it will be possible to heap dumps upon request, e.g. `kill -SIGUSR1 <pid>`. Support for dumping the heap dump upon an out of memory error will follow up.
ja_jp: GraalVM 22.2.0 からは、要求に応じてダンプをヒープすることが可能になります (例: `kill -SIGUSR1 <pid>`)。メモリー不足エラーの際のヒープダンプのダンプのサポートは、今後追加される予定です。

source: Starting with JDK 24, link:https://openjdk.org/projects/leyden/[Project Leyden] introduces powerful AOT caching capabilities (link:https://openjdk.org/jeps/483[JEP 483]) that can significantly reduce Java application startup time. Quarkus provides first-class support for these features, making it easy to build and deploy AOT-optimized applications.
ja_jp: JDK 24 以降、 link:https://openjdk.org/projects/leyden/[Project Leyden] により、Java アプリケーションの起動時間を大幅に短縮できる強力な AOT キャッシング機能 (link:https://openjdk.org/jeps/483[JEP 483]) が導入されました。 Quarkus はこれらの機能をファーストクラスでサポートしており、AOT 最適化されたアプリケーションのビルドとデプロイを容易にします。

source: Starting with JDK 24, the JVM provides an evolution of the class-data sharing in the form of the AOT cache. If you are building an application that will target JDK 24+ you can take advantage of this feature by adding the following system property when packaging your application:
ja_jp: JDK 24から、JVMはAOTキャッシュの形でクラス・データ共有の進化を提供します。 JDK 24+をターゲットとするアプリケーションをビルドしている場合、アプリケーションをパッケージ化する際に以下のシステム・プロパティを追加することで、この機能を利用することができます：

source: Starting with JDK 24, the JVM provides an evolution of the class-data sharing in the form of the AOT cache. If you are building an application that will target JDK 25+ you can take advantage of this feature by adding the following system property when packaging your application:
ja_jp: JDK 24 以降、JVM は AOT キャッシュの形でクラスデータ共有の進化版を提供しています。JDK 25 以降をターゲットとするアプリケーションを構築している場合は、アプリケーションをパッケージ化する際に以下のシステムプロパティーを追加することで、この機能を利用できます。

source: Starting with Java 24, thanks to link:https://openjdk.org/jeps/491[JEP 491], `synchronized` blocks no longer cause pinning. This means pinning is much less likely to occur on Java 24+, occurring only when native code calls back to Java code that performs blocking operations.
ja_jp: Java 24 以降、 link:https://openjdk.org/jeps/491[JEP 491] のおかげで、`synchronized` ブロックはピン留めを引き起こさなくなりました。 これにより、Java 24 以降ではピン留めが発生する可能性がはるかに低くなり、ネイティブコードがブロッキング操作を実行する Java コードをコールバックする場合にのみ発生します。

source: Starting with Mandrel 23.1 and GraalVM for JDK 21, `-H:ResourceConfigurationFiles=resources-config.json` results in a warning being shown unless wrapped in `-H:+UnlockExperimentalVMOptions` and `-H:-UnlockExperimentalVMOptions`. The absence of these options will result in build failures in the future.
ja_jp: Mandrel 23.1 および GraalVM for JDK 21 以降では、 `-H:+UnlockExperimentalVMOptions` および `-H:-UnlockExperimentalVMOptions` でラップされていない限り、 `-H:ResourceConfigurationFiles=resources-config.json` で警告が表示されます。これらのオプションがないと、将来ビルドに失敗します。

source: Starting with Mandrel 23.1 and GraalVM for JDK 21, the native executable generation process will warn about the use of experimental options with a message like this:
ja_jp: Mandrel 23.1 および GraalVM for JDK 21 以降では、ネイティブ実行可能ファイル生成プロセスで、実験的なオプションの使用について次のようなメッセージで警告が表示されます。

source: Starting with Oracle GraalVM 20.2 or Mandrel 20.1, debug symbols for native executables can be generated for Linux environments (Windows support is still under development, macOS is not supported). These symbols can be used to debug native executables with tools such as `gdb`.
ja_jp: Oracle GraalVM 20.2 または Mandrel 20.1 から、Linux 環境用にネイティブ実行可能ファイルのデバッグシンボルを生成できるようになりました (Windowsのサポートは開発中、macOSはサポート対象外)。これらのシンボルは、 `gdb` のようなツールを使用してネイティブ実行可能ファイルをデバッグするために使用できます。

source: Starting with Quarkus 2.11, the images use Java 17 by default. You can go back to the Java 11 images by using the `quarkus.native.builder-image` configuration property.
ja_jp: Quarkus 2.11以降では、イメージはデフォルトでJava 17を使用します。 `quarkus.native.builder-image` 設定プロパティを使用すると、Java 11のイメージに戻すことができます。

source: Starting with Quarkus 2.3, the Quarkus team is thinking of making RESTEasy _reactive_ the default way to implement HTTP APIs. It does not mean that the RESTEasy _classic_ extension will be retired, just that we reach the point where RESTEasy _reactive_ gives you more without burden.
ja_jp: Quarkus 2.3から、QuarkusチームはRESTEasy _reactive_ をHTTP APIを実装するためのデフォルトの方法にすることを考えています。これは、RESTEasy _classic_ エクステンションが廃止されることを意味するものではなく、RESTEasy _reactive_ が負担なくより多くのことを提供できる段階に到達することを意味しています。

source: Starting with Quarkus 3.0, you can expose technical endpoints such as the health and metrics on a different interface thanks to link:/guides/management-interface-reference[a specific management interface].
ja_jp: Quarkus 3.0からは、 link:/guides/management-interface-reference[特定の管理インターフェース] により、healthやmetricsなどの技術的なエンドポイントを別のインターフェースで公開することができるようになりました。

source: Starting with Quarkus 3.19+, the _builder_ image used to build the native executable is based on UBI 9. It means that the native executable produced by the container build will be based on UBI 9 as well. So, if you plan to build a container, make sure that the base image in your `Dockerfile` is compatible with UBI 9. The native executable will not run on UBI 8 base images.
ja_jp: Quarkus 3.19以降では、ネイティブ実行可能ファイルのビルドに使用される _ビルダー_ イメージはUBI 9に基づいています。つまり、コンテナのビルドによって生成されるネイティブ実行可能ファイルもUBI 9に基づいています。したがって、コンテナのビルドを計画している場合は、 `Dockerfile` のベースイメージが UBI 9 と互換性があることを確認してください。ネイティブ実行可能ファイルはUBI 8ベースイメージでは実行できません。

source: Starting your application
ja_jp: アプリケーションの起動

source: Starting/Stopping a Non-CDI Service
ja_jp: 非CDIサービスの開始/停止

source: Startup Event
ja_jp: スタートアップイベント

source: Startup and Shutdown Events
ja_jp: スタートアップとシャットダウンのイベント

source: Startup and warmup time improvements are significant, but not as substantial as with GraalVM/Mandrel native image.
ja_jp: 起動時間とウォームアップ時間の改善は著しいですが、GraalVM/Mandrel ネイティブイメージほど実質的ではありません。

source: Startup checks
ja_jp: 起動時チェック

source: Startup code
ja_jp: 起動コード

source: Startup icon
ja_jp: 起動のアイコン

source: Startup time
ja_jp: 起動時間

source: Startup time and memory footprint are significantly reduced.
ja_jp: 起動時間とメモリフットプリントが大幅に削減されます。

source: Startup time is greatly improved by Leyden, both for small and very large applications. While it doesn't quite match the startup speed of a native executable, the results are still impressive.
ja_jp: Leyden は、小規模アプリケーションと非常に大規模なアプリケーションの両方で起動時間を大幅に改善します。ネイティブ実行可能ファイルの起動速度には及ばないものの、その結果は依然として素晴らしいものです。

source: State (advance)
ja_jp: 状態 (事前)

source: State allows properties to contain state and can be reused globally. An example of state properties is the theme, the connection state (if we are connected to the backend), etc.
ja_jp: 状態を使用することで、プロパティーに状態を含めることができ、グローバルに再利用できます。状態プロパティーの例としては、テーマ、接続状態 (バックエンドに接続している場合) などがあります。

source: State cookie age
ja_jp: State Cookie の有効期間

source: State cookie encryption secret
ja_jp: State Cookie 暗号化シークレット

source: State cookie properties
ja_jp: State Cookie プロパティー

source: State cookies
ja_jp: 状態 Cookie

source: State cookies are used to support authorization code flow completion. When an authorization code flow is started, Quarkus creates a state cookie and a matching `state` query parameter, before redirecting the user to the OIDC provider.
ja_jp: 状態 Cookie は、認可コードフローの完了をサポートするために使用されます。 認可コードフローが開始されると、Quarkus はユーザーを OIDC プロバイダーにリダイレクトする前に、状態 Cookie と一致する `state` クエリーパラメーターを作成します。

source: State cookies are used to support authorization code flow completion. When an authorization code flow is started, Quarkus creates a state cookie and a matching `state` query parameter, before redirecting the user to the OIDC provider. When the user is redirected back to Quarkus to complete the authorization code flow, Quarkus expects that the request URI must contain the `state` query parameter and it must match the current state cookie value.
ja_jp: 状態 Cookie は、認可コードフローの完了をサポートするために使用されます。 認可コードフローが開始されると、Quarkus はユーザーを OIDC プロバイダーにリダイレクトする前に、状態 Cookie と一致する `state` クエリーパラメーターを作成します。 ユーザーが認可コードフローを完了するために Quarkus にリダイレクトされると、Quarkus はリクエスト URI に `state` クエリーパラメーターが含まれており、それが現在の状態 Cookie の値と一致していると想定します。

source: State store implementations determine where and how the processing states are persisted. This is configured by the `mp.messaging.incoming.[channel-name].checkpoint.state-store` property. The serialization of state objects depends on the state store implementation. In order to instruct state stores for serialization can require configuring the class name of state objects using `mp.messaging.incoming.[channel-name].checkpoint.state-type` property.
ja_jp: ステートストアの実装は、処理状態をどこに、どのように永続化するかを決定します。これは、 `mp.messaging.incoming.[channel-name].checkpoint.state-store` プロパティによって設定されます。ステートオブジェクトのシリアライゼーションは、ステートストアの実装に依存します。ステートストアにシリアライズを指示するためには、 `mp.messaging.incoming.[channel-name].checkpoint.state-type` プロパティを使用してステートオブジェクトのクラス名を設定する必要があります。

source: State stores
ja_jp: ステートストア

source: Stateful processing with Checkpointing
ja_jp: チェックポイントによるステートフル処理

source: Statement Inspectors
ja_jp: ステートメントインスペクター

source: Static CDI injection points involving the Mongo Client, such as `@Inject ReactiveMongoClient mongoClient` or `@Inject MongoClient mongoClient`, cause application startup to fail.
ja_jp: `@Inject ReactiveMongoClient mongoClient` や `@Inject MongoClient mongoClient` など、Mongo クライアントを含む静的 CDI 注入ポイントは、アプリケーションの起動に失敗する原因となります。

source: Static CDI injection points involving the Redis Client, such as `@Inject ReactiveRedisDataSource redis` or `@Inject RedisDataSource redis`, cause application startup to fail.
ja_jp: `@Inject ReactiveRedisDataSource redis` や `@Inject RedisDataSource redis` など、 Redis クライアントに関連する静的な CDI インジェクションポイントは、アプリケーションの起動を失敗させます。

source: Static CDI injection points involving the datasource, such as `@Inject DataSource ds` or `@Inject Pool pool`, cause application startup to fail.
ja_jp: `@Inject DataSource ds` や `@Inject Pool pool` など、データソースを含む静的 CDI インジェクション・ポイントは、アプリケーションの起動を失敗させます。

source: Static CDI injection points involving the persistence unit, such as `@Inject SessionFactory sf` or `@Inject Session session`, cause application startup to fail.
ja_jp: `@Inject SessionFactory sf` や `@Inject Session session` など、永続化ユニットに関連する静的 CDI 注入ポイントは、アプリケーションの起動に失敗する原因となります。

source: Static Config Keys in Codestart
ja_jp: Codestart の静的設定キー

source: Static Init
ja_jp: スタティック初期化

source: Static Init Config
ja_jp: Static Init 設定

source: Static OIDC tenants can be created programmatically like in the example below:
ja_jp: OIDC テナントは、次の例のようにプログラムで作成できます。

source: Static Topology
ja_jp: 静的トポロジー

source: Static initialization
ja_jp: 静的な初期化

source: Static metamodel
ja_jp: 静的メタモデル

source: Static metamodel and Jakarta Data
ja_jp: 静的メタモデルと Jakarta Data

source: Static modules are automatically watched and reloaded. Think of everyone's favorite `quarkus:dev`, but with Rust and Go modules
ja_jp: 静的モジュールは自動的に監視され、リロードされます。誰もがお気に入りの `quarkus:dev` を、Rust や Go のモジュールでも利用できると考えてください。

source: Static nested classes declared on a test class that is annotated with `@QuarkusComponentTest` are excluded from bean discovery when running a `@QuarkusTest` in order to prevent unintentional CDI conflicts.
ja_jp: `@QuarkusComponentTest` でアノテーションが付けられたテストクラスで宣言された静的ネストクラスは、意図しない CDI 競合を防ぐために、 `@QuarkusTest` の実行時に Bean 検出から除外されます。
